In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
data = pd.read_csv("tested.csv")
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [10]:
data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [24]:
data2 = pd.get_dummies(data, columns=["Sex"])
data2[['Sex_female', 'Sex_male']]

     Sex_female  Sex_male
0             0         1
1             1         0
2             0         1
3             0         1
4             1         0
..          ...       ...
413           0         1
414           1         0
415           0         1
416           0         1
417           0         1

[418 rows x 2 columns]

In [39]:
data3 = data.groupby("Sex").sum()
data3

C:\Users\franf\AppData\Local\Temp\ipykernel_13568\1067133930.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  data3 = data.groupby("Sex").sum()

        PassengerId  Survived  Pclass      Age  SibSp  Parch       Fare
Sex
female       166712       152     326  3844.59     86     91  7561.6502
male         293297         0     621  6205.91    101     73  7294.8874

In [36]:
data.shape

(418, 12)

In [38]:
152+266

418

In [40]:
data[["Survived","Sex"]]

     Survived     Sex
0           0    male
1           1  female
2           0    male
3           0    male
4           1  female
..        ...     ...
413         0    male
414         1  female
415         0    male
416         0    male
417         0    male

[418 rows x 2 columns]